# ModelAlreadyCheckedOutByUser Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..ModelAlreadyCheckedOutByUser Property
BuiltInFailures..::..OpeningFailures Class See Also
---
The Cloud WorkSharing Model is already checked out by the current user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ModelAlreadyCheckedOutByUser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModelAlreadyCheckedOutByUser As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ModelAlreadyCheckedOutByUser {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace